[Killed] BlockStatement
main/components/Commons/CommonsOverview.js:7:67
 import { daysElapsed } from "main/utils/commonsUtils";
 import { hasRole } from "main/utils/currentUser";
 
-export default function CommonsOverview({ commons, currentUser }) {
-
-    let navigate = useNavigate();
-    // Stryker disable next-line all
-    const leaderboardButtonClick = () => { navigate("/leaderboard/" + commons.id) };
-    const showLeaderboard = (hasRole(currentUser, "ROLE_ADMIN") || commons.showLeaderboard );
-    return (
-        <Card data-testid="CommonsOverview">
-            <Card.Header as="h5">Announcements</Card.Header>
-            <Card.Body>
-                <Row>
-                    <Col>
-                        <Card.Title>Today is Day: {daysElapsed(commons.startingDate, Date.now())} </Card.Title>
-                    </Col>
-                    <Col>
-                        {showLeaderboard &&
-                        (<Button variant="outline-success" data-testid="user-leaderboard-button" onClick={leaderboardButtonClick}>
-                            Leaderboard
-                        </Button>)}
-                    </Col>
-                </Row>
-            </Card.Body>
-        </Card>
-    );
-}; 
+export default function CommonsOverview({ commons, currentUser }) {}; 
killedBy: PlayPage tests click buy and sell buttons
statusReason: Error: CommonsOverview(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
