[Killed] BlockStatement
main/components/Commons/CommonsTable.js:14:36
 export default function CommonsTable({ commons, currentUser }) {
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/admin/editcommons/${cell.row.values["commons.id"]}`);
-    };
+    const editCallback = (cell) => {};
 
     // Stryker disable all : hard to test for query caching
killedBy: AdminListCommonPage tests what happens when you click edit as an admin
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/admin/editcommons/1"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/components/Commons/CommonsTable.js:32:43
         deleteMutation.mutate(cell);
     };
 
-    const leaderboardCallback = (cell) => {
-        navigate(`/leaderboard/${cell.row.values["commons.id"]}`);
-    };
+    const leaderboardCallback = (cell) => {};
 
     const columns = [
killedBy: AdminListCommonPage tests what happens when you click leaderboard as an admin
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/leaderboard/1"

Number of calls: 0

<html>
  <head />

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.js:37:9
     };
 
     const columns = [
-        {
-            Header: "id",
-            accessor: "commons.id", // accessor is the "key" in the data
-        },
+        {},
         {
             Header: "Name",
killedBy: AdminListCommonPage tests renders without crashing for regular user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:39:23
     const columns = [
         {
             Header: "id",
-            accessor: "commons.id", // accessor is the "key" in the data
+            accessor: "", // accessor is the "key" in the data
         },
         {
killedBy: AdminListCommonPage tests renders three commons without crashing for admin user
statusReason: Error: Unable to find an element by: [data-testid="CommonsTable-cell-row-0-col-commons.id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.js:45:9
             Header: "Name",
             accessor: "commons.name",
         },
-        {
-            Header: "Cow Price",
-            accessor: (row) => row.commons.cowPrice,
-            id: "commons.cowPrice",
-        },
+        {},
         {
             Header: "Price Change",
killedBy: AdminListCommonPage tests renders without crashing for regular user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:47:23
         },
         {
             Header: "Cow Price",
-            accessor: (row) => row.commons.cowPrice,
+            accessor: () => undefined,
             id: "commons.cowPrice",
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: 11. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white;"

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.js:50:9
             accessor: (row) => row.commons.cowPrice,
             id: "commons.cowPrice",
         },
-        {
-            Header: "Price Change",
-            accessor: "priceChange",
-        },
+        {},
         {
             Header: "Milk Price",
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:55:21
             accessor: "priceChange",
         },
         {
-            Header: "Milk Price",
+            Header: "",
             accessor: (row) => row.commons.milkPrice,
             id: "commons.milkPrice",
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Milk Price. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white;"

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:56:23
         },
         {
             Header: "Milk Price",
-            accessor: (row) => row.commons.milkPrice,
+            accessor: () => undefined,
             id: "commons.milkPrice",
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: 4. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white;"

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:61:23
         },
         {
             Header: "Starting Balance",
-            accessor: (row) => row.commons.startingBalance,
+            accessor: () => undefined,
             id: "commons.startingBalance",
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: 74. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white;"

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:65:21
             id: "commons.startingBalance",
         },
         {
-            Header: "Starting Date",
+            Header: "",
             accessor: (row) => String(row.commons.startingDate).slice(0, 10),
             id: "commons.startingDate",
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Starting Date. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white;"

[Killed] MethodExpression
main/components/Commons/CommonsTable.js:66:32
         },
         {
             Header: "Starting Date",
-            accessor: (row) => String(row.commons.startingDate).slice(0, 10),
+            accessor: (row) => String(row.commons.startingDate),
             id: "commons.startingDate",
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: 2022-11-26. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white;"

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:66:23
         },
         {
             Header: "Starting Date",
-            accessor: (row) => String(row.commons.startingDate).slice(0, 10),
+            accessor: () => undefined,
             id: "commons.startingDate",
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: 2022-11-26. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white;"

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:71:23
         },
         {
             Header: "Degradation Rate",
-            accessor: (row) => row.commons.degradationRate,
+            accessor: () => undefined,
             id: "commons.degradationRate",
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: 5. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white;"

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:75:21
             id: "commons.degradationRate",
         },
         {
-            Header: "Show Leaderboard?",
+            Header: "",
             id: "commons.showLeaderboard", // needed for tests
             accessor: (row, _rowIndex) => String(row.commons.showLeaderboard), // hack needed for boolean values to show up
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Show Leaderboard?. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white;"

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:76:17
         },
         {
             Header: "Show Leaderboard?",
-            id: "commons.showLeaderboard", // needed for tests
+            id: "", // needed for tests
             accessor: (row, _rowIndex) => String(row.commons.showLeaderboard), // hack needed for boolean values to show up
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CommonsTable-cell-row-0-col-commons.showLeaderboard"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white;"

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:77:23
         {
             Header: "Show Leaderboard?",
             id: "commons.showLeaderboard", // needed for tests
-            accessor: (row, _rowIndex) => String(row.commons.showLeaderboard), // hack needed for boolean values to show up
+            accessor: () => undefined, // hack needed for boolean values to show up
         },
         {
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: false. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white;"

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:80:21
             accessor: (row, _rowIndex) => String(row.commons.showLeaderboard), // hack needed for boolean values to show up
         },
         {
-            Header: "Cows",
+            Header: "",
             accessor: "totalCows",
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser commonsPlus
statusReason: TestingLibraryElementError: Unable to find an element with the text: Cows. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white;"

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:81:23
         },
         {
             Header: "Cows",
-            accessor: "totalCows",
+            accessor: "",
         },
         {
killedBy: UserTable tests Has the expected column headers and content for adminUser commonsPlus
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CommonsTable-cell-row-0-col-totalCows"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white;"

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:85:23
         },
         {
             Header: "Carrying Capacity",
-            accessor: (row) => row.commons.carryingCapacity,
+            accessor: () => undefined,
             id: "commons.carryingCapacity",
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: 123. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white;"

[Killed] ArrayDeclaration
main/components/Commons/CommonsTable.js:92:28
 
     const testid = "CommonsTable";
 
-    const columnsIfAdmin = [
-        ...columns,
-        ButtonColumn("Edit", "primary", editCallback, testid),
-        ButtonColumn("Delete", "danger", deleteCallback, testid),
-        ButtonColumn("Leaderboard", "secondary", leaderboardCallback, testid),
-    ];
+    const columnsIfAdmin = [];
 
     const columnsToDisplay = hasRole(currentUser, "ROLE_ADMIN")
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white;"
