[Killed] BlockStatement
src/main/pages/PlayPage.js:86:42
     );
     // Stryker restore all
 
-    const onBuy = async (userCommons) => {
-        mutationbuynumcows.mutateAsync(userCommons);
-        mutationbuychangeprice.mutateAsync(userCommons);
-    };
+    const onBuy = async (userCommons) => {};
 
     const onSuccessSell = () => {};
killedBy: PlayPage tests click buy and sell buttons
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

<html>
  <head />
  <body>

[Killed] LogicalOperator
src/main/pages/PlayPage.js:138:22
             <BasicLayout>
                 <Container>
                     {!!currentUser && <CommonsPlay currentUser={currentUser} />}
-                    {!!commons && (
-                        <CommonsOverview
-                            commons={commons}
-                            currentUser={currentUser}
-                        />
-                    )}
+                    {!!commons || <CommonsOverview commons={commons} currentUser={currentUser} />}
                     <br />
                     {!!userCommons && (
killedBy: PlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'showLeaderboard')

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:138:22
             <BasicLayout>
                 <Container>
                     {!!currentUser && <CommonsPlay currentUser={currentUser} />}
-                    {!!commons && (
-                        <CommonsOverview
-                            commons={commons}
-                            currentUser={currentUser}
-                        />
-                    )}
+                    {false}
                     <br />
                     {!!userCommons && (
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Error: Unable to find an element with the text: /Announcements/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      data-testid="background"
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >

[Killed] LogicalOperator
src/main/pages/PlayPage.js:145:22
                         />
                     )}
                     <br />
-                    {!!userCommons && (
-                        <CardGroup>
-                            <ManageCows
-                                userCommons={userCommons}
-                                commons={commons}
-                                onBuy={onBuy}
-                                onSell={onSell}
-                            />
-                            <FarmStats userCommons={userCommons} />
-                            <Profits
-                                userCommons={userCommons}
-                                profits={userCommonsProfits}
-                            />
-                        </CardGroup>
-                    )}
+                    {!!userCommons || <CardGroup>
+                            <ManageCows userCommons={userCommons} commons={commons} onBuy={onBuy} onSell={onSell} />
+                            <FarmStats userCommons={userCommons} />
+                            <Profits userCommons={userCommons} profits={userCommonsProfits} />
+                        </CardGroup>}
                 </Container>
             </BasicLayout>
killedBy: PlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'numOfCows')

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:145:22
                         />
                     )}
                     <br />
-                    {!!userCommons && (
+                    {!userCommons && (
                         <CardGroup>
                             <ManageCows
killedBy: PlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'numOfCows')
