[Killed] BlockStatement
main/components/Commons/FarmStats.js:6:40
 import Health from "./../../../assets/Health.png";
 import Cash from "./../../../assets/Cash.png";
 
-const FarmStats = ({ userCommons }) => {
-    return (
-        <Card>
-            <Card.Header as="h5">Your Farm Stats</Card.Header>
-            <Card.Body>
-                {/* update total wealth and cow health with data from fixture */}
-                <Card.Text>
-                    <img className="icon" src={Cash} alt="Cash"></img>
-                </Card.Text>
-                <Card.Text>
-                    Total Wealth: ${userCommons.totalWealth.toFixed(2)}
-                </Card.Text>
-                <Card.Text>
-                    <img className="icon" src={Health} alt="Health"></img>
-                </Card.Text>
-                <Card.Text>
-                    Cow Health: {Math.round(userCommons.cowHealth * 100) / 100}%
-                </Card.Text>
-            </Card.Body>
-        </Card>
-    );
-};
+const FarmStats = ({ userCommons }) => {};
 
 export default FarmStats;
killedBy: PlayPage tests click buy and sell buttons
statusReason: Error: FarmStats(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ArithmeticOperator
main/components/Commons/FarmStats.js:22:34
                     <img className="icon" src={Health} alt="Health"></img>
                 </Card.Text>
                 <Card.Text>
-                    Cow Health: {Math.round(userCommons.cowHealth * 100) / 100}%
+                    Cow Health: {Math.round(userCommons.cowHealth * 100) * 100}%
                 </Card.Text>
             </Card.Body>
killedBy: FarmStats tests contains correct content
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Cow Health: 98%/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] ArithmeticOperator
main/components/Commons/FarmStats.js:22:45
                     <img className="icon" src={Health} alt="Health"></img>
                 </Card.Text>
                 <Card.Text>
-                    Cow Health: {Math.round(userCommons.cowHealth * 100) / 100}%
+                    Cow Health: {Math.round(userCommons.cowHealth / 100) / 100}%
                 </Card.Text>
             </Card.Body>
killedBy: FarmStats tests contains correct content
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Cow Health: 98%/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card"
    >
      <h5
