[Killed] OptionalChaining
main/components/Commons/ManageCows.js:11:41
             <Card.Header as="h5">Manage Cows</Card.Header>
             <Card.Body>
                 <Card.Title>
-                    Market Cow Price: ${commons?.cowPrice?.toFixed(2)}
+                    Market Cow Price: ${commons.cowPrice?.toFixed(2)}
                 </Card.Title>
                 <Card.Title>Number of Cows: {userCommons.numOfCows}</Card.Title>
killedBy: ManageCows tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'cowPrice')

[Killed] OptionalChaining
main/components/Commons/ManageCows.js:11:41
             <Card.Header as="h5">Manage Cows</Card.Header>
             <Card.Body>
                 <Card.Title>
-                    Market Cow Price: ${commons?.cowPrice?.toFixed(2)}
+                    Market Cow Price: ${commons?.cowPrice.toFixed(2)}
                 </Card.Title>
                 <Card.Title>Number of Cows: {userCommons.numOfCows}</Card.Title>
killedBy: PlayPage tests click buy and sell buttons
statusReason: TypeError: Cannot read properties of undefined (reading 'toFixed')

[Killed] OptionalChaining
main/components/Commons/ManageCows.js:15:43
                 </Card.Title>
                 <Card.Title>Number of Cows: {userCommons.numOfCows}</Card.Title>
                 <Card.Title>
-                    Current Milk Price: ${commons?.milkPrice}
+                    Current Milk Price: ${commons.milkPrice}
                 </Card.Title>
                 <Row>
killedBy: ManageCows tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'milkPrice')

[Killed] BlockStatement
main/components/Commons/ManageCows.js:30:44
                     <Col>
                         <Button
                             variant="outline-danger"
-                            onClick={() => {
-                                onBuy(userCommons);
-                            }}
+                            onClick={() => {}}
                             data-testid={"buy-cow-button"}
                         >
killedBy: ManageCows tests buying and selling a cow
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/components/Commons/ManageCows.js:41:44
                         <br />
                         <Button
                             variant="outline-danger"
-                            onClick={() => {
-                                onSell(userCommons);
-                            }}
+                            onClick={() => {}}
                             data-testid={"sell-cow-button"}
                         >
killedBy: ManageCows tests buying and selling a cow
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
