[Killed] BlockStatement
src/main/utils/commonsUtils.js:18:40
     }
 }
 
-export function daysElapsed(start, end){
-    let startTime = new Date(start).getTime();
-    let endTime = new Date(end).getTime();
-    var diff = Math.round((endTime - startTime)/(86400000));
-    return (diff > 0)? diff : 0;
-}
+export function daysElapsed(start, end){}
 
killedBy: CommonsUtils daysElapsed test Difference between 2 dates
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ArithmeticOperator
src/main/utils/commonsUtils.js:21:28
 export function daysElapsed(start, end){
     let startTime = new Date(start).getTime();
     let endTime = new Date(end).getTime();
-    var diff = Math.round((endTime - startTime)/(86400000));
+    var diff = Math.round((endTime + startTime)/(86400000));
     return (diff > 0)? diff : 0;
 }
killedBy: CommonsUtils daysElapsed test Difference between 2 dates
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 38969

[Killed] ArithmeticOperator
src/main/utils/commonsUtils.js:21:27
 export function daysElapsed(start, end){
     let startTime = new Date(start).getTime();
     let endTime = new Date(end).getTime();
-    var diff = Math.round((endTime - startTime)/(86400000));
+    var diff = Math.round((endTime - startTime) * 86400000);
     return (diff > 0)? diff : 0;
 }
killedBy: CommonsUtils daysElapsed test Difference between 2 dates
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 36599040000000000

[Killed] ConditionalExpression
src/main/utils/commonsUtils.js:22:13
     let startTime = new Date(start).getTime();
     let endTime = new Date(end).getTime();
     var diff = Math.round((endTime - startTime)/(86400000));
-    return (diff > 0)? diff : 0;
+    return (false)? diff : 0;
 }
 
killedBy: CommonsUtils daysElapsed test Difference between 2 dates
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] EqualityOperator
src/main/utils/commonsUtils.js:22:13
     let startTime = new Date(start).getTime();
     let endTime = new Date(end).getTime();
     var diff = Math.round((endTime - startTime)/(86400000));
-    return (diff > 0)? diff : 0;
+    return (diff >= 0)? diff : 0;
 }
 
killedBy: CommonsUtils daysElapsed test Negative days checker
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -0
