[Survived] StringLiteral
main/components/Commons/ManageCows.js:13:19
     // update cowPrice from fixture
     var cowHealth = Math.round(userCommons.cowHealth*100)/100;
     var cowHead = averageCowHead;
-    var cowIcon = "happyCowIcon";
+    var cowIcon = "";
 
     if (cowHealth >= 0) {

[Killed] BlockStatement
main/components/Commons/ManageCows.js:15:25
     var cowHead = averageCowHead;
     var cowIcon = "happyCowIcon";
 
-    if (cowHealth >= 0) {
-        cowHead = sickCowHead;
-        cowIcon = "sickCowIcon";
-    }
+    if (cowHealth >= 0) {}
     if (cowHealth >= 50) {
         cowHead = sadCowHead;
killedBy: ManageCows tests when cowHealth is below 50%, it displays a sick cow 
statusReason: TestingLibraryElementError: Unable to find an element with the alt text: sickCowIcon

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] EqualityOperator
main/components/Commons/ManageCows.js:15:9
     var cowHead = averageCowHead;
     var cowIcon = "happyCowIcon";
 
-    if (cowHealth >= 0) {
+    if (cowHealth < 0) {
         cowHead = sickCowHead;
         cowIcon = "sickCowIcon";
killedBy: ManageCows tests when cowHealth is below 50%, it displays a sick cow 
statusReason: TestingLibraryElementError: Unable to find an element with the alt text: sickCowIcon

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] ConditionalExpression
main/components/Commons/ManageCows.js:19:9
         cowHead = sickCowHead;
         cowIcon = "sickCowIcon";
     }
-    if (cowHealth >= 50) {
+    if (false) {
         cowHead = sadCowHead;
         cowIcon = "sadCowIcon";
killedBy: ManageCows tests when cowHealth is between 50-80%, it displays a sad cow 
statusReason: TestingLibraryElementError: Unable to find an element with the alt text: sadCowIcon

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] ConditionalExpression
main/components/Commons/ManageCows.js:19:9
         cowHead = sickCowHead;
         cowIcon = "sickCowIcon";
     }
-    if (cowHealth >= 50) {
+    if (true) {
         cowHead = sadCowHead;
         cowIcon = "sadCowIcon";
killedBy: ManageCows tests when cowHealth is below 50%, it displays a sick cow 
statusReason: TestingLibraryElementError: Unable to find an element with the alt text: sickCowIcon

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] ConditionalExpression
main/components/Commons/ManageCows.js:23:9
         cowHead = sadCowHead;
         cowIcon = "sadCowIcon";
     }
-    if (cowHealth >= 80) {
+    if (true) {
         cowHead = averageCowHead;
         cowIcon = "averageCowIcon";
killedBy: ManageCows tests when cowHealth is between 50-80%, it displays a sad cow 
statusReason: TestingLibraryElementError: Unable to find an element with the alt text: sadCowIcon

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] ConditionalExpression
main/components/Commons/ManageCows.js:23:9
         cowHead = sadCowHead;
         cowIcon = "sadCowIcon";
     }
-    if (cowHealth >= 80) {
+    if (false) {
         cowHead = averageCowHead;
         cowIcon = "averageCowIcon";
killedBy: ManageCows tests when cowHealth is between 80-90%, it displays a average cow 
statusReason: TestingLibraryElementError: Unable to find an element with the alt text: averageCowIcon

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] ConditionalExpression
main/components/Commons/ManageCows.js:27:9
         cowHead = averageCowHead;
         cowIcon = "averageCowIcon";
     }
-    if (cowHealth >= 90) {
+    if (true) {
         cowHead = happyCowHead;
         cowIcon = "happyCowIcon";
killedBy: ManageCows tests when cowHealth is between 80-90%, it displays a average cow 
statusReason: TestingLibraryElementError: Unable to find an element with the alt text: averageCowIcon

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] EqualityOperator
main/components/Commons/ManageCows.js:27:9
         cowHead = averageCowHead;
         cowIcon = "averageCowIcon";
     }
-    if (cowHealth >= 90) {
+    if (cowHealth < 90) {
         cowHead = happyCowHead;
         cowIcon = "happyCowIcon";
killedBy: ManageCows tests when cowHealth is above 90%, it displays a happy cow 
statusReason: TestingLibraryElementError: Unable to find an element with the alt text: happyCowIcon

<body>
  <div>
    <div
      class="card"
    >
      <h5
