[Killed] BlockStatement
src/main/pages/AdminJobsPage.js:30:43
     );
     // Stryker restore all
 
-    const submitTestJob = async (data) => {
-        toast(<div>Test Job Initiated and Running!</div>);
-        testJobMutation.mutate(data);
-    }
+    const submitTestJob = async (data) => {}
 
     // Stryker disable all
killedBy: AdminJobsPage tests user can submit a test job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ArrowFunction
src/main/pages/AdminJobsPage.js:50:51
 
     // UpdateCowHealth job
 
-    const objectToAxiosParamsUpdateCowHealthJob = () => ({
-        url: `/api/jobs/launch/updatecowhealth`,
-        method: "POST"
-    });
+    const objectToAxiosParamsUpdateCowHealthJob = () => undefined;
 
     // Stryker disable all
killedBy: AdminJobsPage tests user can submit update cow health job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/AdminJobsPage.js:63:50
     );
     // Stryker restore all
 
-    const submitUpdateCowHealthJob = async () => {
-        toast(<div>Updating Cow Health Initiated and Running!</div>);
-        UpdateCowHealthMutation.mutate();
-    }
+    const submitUpdateCowHealthJob = async () => {}
 
     // MilkTheCows job
killedBy: AdminJobsPage tests user can submit update cow health job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ArrowFunction
src/main/pages/AdminJobsPage.js:70:47
 
     // MilkTheCows job
 
-    const objectToAxiosParamsMilkTheCowsJob = () => ({
-        url: `/api/jobs/launch/milkthecowjob`,
-        method: "POST"
-    });
+    const objectToAxiosParamsMilkTheCowsJob = () => undefined;
    
     // Stryker disable all
killedBy: AdminJobsPage tests user can submit milk the cows job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/AdminJobsPage.js:83:46
     );
     // Stryker restore all
 
-    const submitMilkTheCowsJob = async () => {
-        toast(<div>Milking Cows Initiated and Running!</div>);
-        MilkTheCowsMutation.mutate();
-    }
+    const submitMilkTheCowsJob = async () => {}
 
     const jobLaunchers = [
killedBy: AdminJobsPage tests user can submit milk the cows job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
src/main/pages/AdminJobsPage.js:97:9
             name: "Update Cow Health",
             form: <UpdateCowHealthForm submitAction={submitUpdateCowHealthJob} />
         },
-        {
-            name: "Milk The Cows",
-            form: <MilkCowsJobForm submitAction={submitMilkTheCowsJob} />
-        },
+        {},
         {
             name: "Instructor Report",
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: Unable to find an element with the text: Milk The Cows. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
src/main/pages/AdminJobsPage.js:113:38
             <h2 className="p-3">Launch Jobs</h2>
             <Accordion>
                 {
-                    jobLaunchers.map((jobLauncher, index) => (
-                        <Accordion.Item eventKey={index}>
-                            <Accordion.Header>{jobLauncher.name}</Accordion.Header>
-                            <Accordion.Body>
-                                {jobLauncher.form}
-                            </Accordion.Body>
-                        </Accordion.Item>
-                    ))
+                    jobLaunchers.map(() => undefined)
                 }
             </Accordion>
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: Unable to find an element with the text: Test Job. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
