[Killed] ArithmeticOperator
main/components/Commons/ManageCows.js:11:21
 // add parameters 
 const ManageCows = ({userCommons,commons, onBuy, onSell}) =>  {
     // update cowPrice from fixture
-    var cowHealth = Math.round(userCommons.cowHealth*100)/100;
+    var cowHealth = Math.round(userCommons.cowHealth * 100) * 100;
     var cowHead = sickCowHead;
     var cowIcon = "sickCowIcon";
killedBy: ManageCows tests when cowHealth is 93% or above, it displays a happy cow
statusReason: Error: Unable to find an element with the text: /Cow Health: 93%/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] ArithmeticOperator
main/components/Commons/ManageCows.js:11:32
 // add parameters 
 const ManageCows = ({userCommons,commons, onBuy, onSell}) =>  {
     // update cowPrice from fixture
-    var cowHealth = Math.round(userCommons.cowHealth*100)/100;
+    var cowHealth = Math.round(userCommons.cowHealth / 100)/100;
     var cowHead = sickCowHead;
     var cowIcon = "sickCowIcon";
killedBy: ManageCows tests when cowHealth is 93% or above, it displays a happy cow
statusReason: Error: Unable to find an element with the text: /Cow Health: 93%/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] StringLiteral
main/components/Commons/ManageCows.js:13:19
     // update cowPrice from fixture
     var cowHealth = Math.round(userCommons.cowHealth*100)/100;
     var cowHead = sickCowHead;
-    var cowIcon = "sickCowIcon";
+    var cowIcon = "";
 
     if (cowHealth >= 93) {
killedBy: ManageCows tests when cowHealth is below 72%, it displays a sick cow
statusReason: TestingLibraryElementError: Unable to find an element with the alt text: sickCowIcon

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] ConditionalExpression
main/components/Commons/ManageCows.js:15:9
     var cowHead = sickCowHead;
     var cowIcon = "sickCowIcon";
 
-    if (cowHealth >= 93) {
+    if (true) {
         cowHead = happyCowHead;
         cowIcon = "happyCowIcon";
killedBy: ManageCows tests when cowHealth is 84%-92%, it displays a average cow
statusReason: TestingLibraryElementError: Unable to find an element with the alt text: averageCowIcon

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] EqualityOperator
main/components/Commons/ManageCows.js:15:9
     var cowHead = sickCowHead;
     var cowIcon = "sickCowIcon";
 
-    if (cowHealth >= 93) {
+    if (cowHealth < 93) {
         cowHead = happyCowHead;
         cowIcon = "happyCowIcon";
killedBy: ManageCows tests when cowHealth is 93% or above, it displays a happy cow
statusReason: TestingLibraryElementError: Unable to find an element with the alt text: happyCowIcon

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] BlockStatement
main/components/Commons/ManageCows.js:18:33
     if (cowHealth >= 93) {
         cowHead = happyCowHead;
         cowIcon = "happyCowIcon";
-    } else if (cowHealth >= 84) {
-        cowHead = averageCowHead;
-        cowIcon = "averageCowIcon";
-    } else if (cowHealth >= 72) {
+    } else if (cowHealth >= 84) {} else if (cowHealth >= 72) {
         cowHead = sadCowHead;
         cowIcon = "sadCowIcon";
killedBy: ManageCows tests when cowHealth is 84%-92%, it displays a average cow
statusReason: TestingLibraryElementError: Unable to find an element with the alt text: averageCowIcon

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] ConditionalExpression
main/components/Commons/ManageCows.js:18:16
     if (cowHealth >= 93) {
         cowHead = happyCowHead;
         cowIcon = "happyCowIcon";
-    } else if (cowHealth >= 84) {
+    } else if (false) {
         cowHead = averageCowHead;
         cowIcon = "averageCowIcon";
killedBy: ManageCows tests when cowHealth is 84%-92%, it displays a average cow
statusReason: TestingLibraryElementError: Unable to find an element with the alt text: averageCowIcon

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] StringLiteral
main/components/Commons/ManageCows.js:20:19
         cowIcon = "happyCowIcon";
     } else if (cowHealth >= 84) {
         cowHead = averageCowHead;
-        cowIcon = "averageCowIcon";
+        cowIcon = "";
     } else if (cowHealth >= 72) {
         cowHead = sadCowHead;
killedBy: ManageCows tests when cowHealth is 84%-92%, it displays a average cow
statusReason: TestingLibraryElementError: Unable to find an element with the alt text: averageCowIcon

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] EqualityOperator
main/components/Commons/ManageCows.js:21:16
     } else if (cowHealth >= 84) {
         cowHead = averageCowHead;
         cowIcon = "averageCowIcon";
-    } else if (cowHealth >= 72) {
+    } else if (cowHealth > 72) {
         cowHead = sadCowHead;
         cowIcon = "sadCowIcon";
killedBy: ManageCows tests when cowHealth is 72%-83%, it displays a sad cow
statusReason: TestingLibraryElementError: Unable to find an element with the alt text: sadCowIcon

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] EqualityOperator
main/components/Commons/ManageCows.js:21:16
     } else if (cowHealth >= 84) {
         cowHead = averageCowHead;
         cowIcon = "averageCowIcon";
-    } else if (cowHealth >= 72) {
+    } else if (cowHealth < 72) {
         cowHead = sadCowHead;
         cowIcon = "sadCowIcon";
killedBy: ManageCows tests when cowHealth is 72%-83%, it displays a sad cow
statusReason: TestingLibraryElementError: Unable to find an element with the alt text: sadCowIcon

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] StringLiteral
main/components/Commons/ManageCows.js:23:19
         cowIcon = "averageCowIcon";
     } else if (cowHealth >= 72) {
         cowHead = sadCowHead;
-        cowIcon = "sadCowIcon";
+        cowIcon = "";
     }
 
killedBy: ManageCows tests when cowHealth is 72%-83%, it displays a sad cow
statusReason: TestingLibraryElementError: Unable to find an element with the alt text: sadCowIcon

<body>
  <div>
    <div
      class="card"
    >
      <h5
