[Killed] BlockStatement
src/main/pages/PlayPage.js:90:36
     );
     // Stryker restore all
 
-    const onBuy = (userCommons) => {
-        mutationbuy.mutate(userCommons);
-    };
+    const onBuy = (userCommons) => {};
 
     const onSuccessSell = () => {};
killedBy: PlayPage tests click buy and sell buttons
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/PlayPage.js:115:37
     );
     // Stryker restore all
 
-    const onSell = (userCommons) => {
-        mutationsell.mutate(userCommons);
-    };
+    const onSell = (userCommons) => {};
 
     return (
killedBy: PlayPage tests click buy and sell buttons
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

<html>
  <head />
  <body>

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:130:22
             <BasicLayout>
                 <Container>
                     {!!currentUser && <CommonsPlay currentUser={currentUser} />}
-                    {!!commons && (
+                    {!commons && (
                         <CommonsOverview
                             commons={commons}
killedBy: PlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'showLeaderboard')

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:137:23
                         />
                     )}
                     <br />
-                    {!!userCommons && !!cowLots && (
+                    {!userCommons && !!cowLots && (
                         <CardGroup>
                             <ManageCows
killedBy: CommonsOverview tests Redirects to the LeaderboardPage for an admin when you click visit
statusReason: TypeError: Cannot read properties of undefined (reading 'cowHealth')
